PQSolutionsPeru/ESP32-IDF/ESP-IDF-HDDESP32/hddesp32/components/mqtt_manager/mqtt_manager.c
        case MQTT_EVENT_DISCONNECTED:
            ESP_LOGW(TAG, "MQTT disconnected");
            
            if (xSemaphoreTake(ctx->mutex, pdMS_TO_TICKS(10)) == pdTRUE) {
                ctx->state = ctx->was_connected ? MQTT_MANAGER_STATE_RECONNECTING : MQTT_MANAGER_STATE_DISCONNECTED;
                xSemaphoreGive(ctx->mutex);
            }
            
            xEventGroupClearBits(ctx->event_group, MQTT_CONNECTED_BIT);
            xEventGroupSetBits(ctx->event_group, MQTT_DISCONNECTED_BIT);
            
            if (ctx->state_callback) {
                ctx->state_callback(ctx->state, ctx->state_user_data);
            }
            break;
            
        case MQTT_EVENT_SUBSCRIBED:
            ESP_LOGI(TAG, "MQTT subscribed, msg_id=%d", event->msg_id);
            break;
            
        case MQTT_EVENT_PUBLISHED:
            // Just update timestamp
            break;
            
        case MQTT_EVENT_DATA:
            if (ctx->message_callback && event->topic_len < MQTT_TOPIC_MAX_LENGTH && event->data_len < DEFAULT_BUFFER_SIZE) {
                static char topic_buf[MQTT_TOPIC_MAX_LENGTH];
                static char data_buf[DEFAULT_BUFFER_SIZE];
                
                memcpy(topic_buf, event->topic, event->topic_len);
                topic_buf[event->topic_len] = '\0';
                
                memcpy(data_buf, event->data, event->data_len);
                data_buf[event->data_len] = '\0';
                
                ctx->message_callback(topic_buf, data_buf, event->data_len, ctx->message_user_data);
            }
            break;
            
        case MQTT_EVENT_ERROR:
            ESP_LOGE(TAG, "MQTT error");
            
            if (xSemaphoreTake(ctx->mutex, pdMS_TO_TICKS(5)) == pdTRUE) {
                ctx->state = MQTT_MANAGER_STATE_ERROR;
                xSemaphoreGive(ctx->mutex);
            }
            
            xEventGroupClearBits(ctx->event_group, MQTT_CONNECTED_BIT);
            xEventGroupSetBits(ctx->event_group, MQTT_ERROR_BIT);
            
            if (ctx->state_callback) {
                ctx->state_callback(ctx->state, ctx->state_user_data);
            }
            break;
            
        default:
            break;
    }
}

// Initialize MQTT Manager - optimized
esp_err_t mqtt_manager_init(void) {
    mqtt_manager_context_t *ctx = &s_mqtt_manager_ctx;
    
    if (ctx->event_group != NULL) {
        ESP_LOGW(TAG, "Already initialized");
        return ESP_ERR_INVALID_STATE;
    }
    
    ESP_LOGI(TAG, "Initializing MQTT Manager");
    
    // Initialize state
    ctx->state = MQTT_MANAGER_STATE_INIT;
    ctx->was_connected = false;
    ctx->reconnect_attempts = 0;
    ctx->last_activity_time = 0;
    ctx->last_heartbeat_time = 0;
    ctx->last_reconnect_time = 0;
    
    // Create event group
    ctx->event_group = xEventGroupCreate();
    if (ctx->event_group == NULL) {
        ESP_LOGE(TAG, "Failed to create event group");
        return ESP_ERR_NO_MEM;
    }
    
    // Create mutex
    ctx->mutex = xSemaphoreCreateMutex();
    if (ctx->mutex == NULL) {
        vEventGroupDelete(ctx->event_group);
        ctx->event_group = NULL;
        ESP_LOGE(TAG, "Failed to create mutex");
        return ESP_ERR_NO_MEM;
    }
    
    // Create message queue
    ctx->pending_messages = xQueueCreate(DEFAULT_MAX_QUEUE_SIZE, sizeof(mqtt_pending_message_t));
    if (ctx->pending_messages == NULL) {
        vSemaphoreDelete(ctx->mutex);
        vEventGroupDelete(ctx->event_group);
        ctx->mutex = NULL;
        ctx->event_group = NULL;
        ESP_LOGE(TAG, "Failed to create message queue");
        return ESP_ERR_NO_MEM;
    }
    
    // Set defaults
    strncpy(ctx->broker_url, DEFAULT_BROKER, sizeof(ctx->broker_url) - 1);
    ctx->broker_url[sizeof(ctx->broker_url) - 1] = '\0';
    ctx->port = DEFAULT_PORT;
    ctx->use_ssl = true;
    ctx->lwt_qos = 1;
    ctx->lwt_retain = false;
    
    ctx->state = MQTT_MANAGER_STATE_DISCONNECTED;
    xEventGroupSetBits(ctx->event_group, MQTT_DISCONNECTED_BIT);
    
    ESP_LOGI(TAG, "MQTT Manager initialized");
    return ESP_OK;
}

// Set ESP32 ID - PRODUCTION READY with validation
esp_err_t mqtt_manager_set_esp32_id(const char *esp32_id) {
    mqtt_manager_context_t *ctx = &s_mqtt_manager_ctx;
    
    if (ctx->event_group == NULL) {
        ESP_LOGE(TAG, "Not initialized");
        return ESP_ERR_INVALID_STATE;
    }
    
    // PRODUCTION: Validate input thoroughly
    esp_err_t validation_result = validate_esp32_id(esp32_id);
    if (validation_result != ESP_OK) {
        return validation_result;
    }
    
    ESP_LOGI(TAG, "Setting credentials for ESP32 ID: %s", esp32_id);
    
    if (xSemaphoreTake(ctx->mutex, portMAX_DELAY) == pdTRUE) {
        // Set credentials - using safe strncpy with validated input
        strncpy(ctx->esp32_id, esp32_id, sizeof(ctx->esp32_id) - 1);
        ctx->esp32_id[sizeof(ctx->esp32_id) - 1] = '\0';
        
        esp32_id_manager_get_mac(ctx->mac_address, sizeof(ctx->mac_address));
        
        strncpy(ctx->client_id, esp32_id, sizeof(ctx->client_id) - 1);
        ctx->client_id[sizeof(ctx->client_id) - 1] = '\0';
        
        strncpy(ctx->username, esp32_id, sizeof(ctx->username) - 1);
        ctx->username[sizeof(ctx->username) - 1] = '\0';
        
        strncpy(ctx->password, esp32_id, sizeof(ctx->password) - 1);
        ctx->password[sizeof(ctx->password) - 1] = '\0';
        
        // Set LWT topic and message
        // Topic: "system/status/" + esp32_id = 14 + 8 = 22 chars max (fits in 128)
        snprintf(ctx->lwt_topic, sizeof(ctx->lwt_topic), "system/status/%s", esp32_id);
        
        char timestamp_str[MQTT_TIMESTAMP_MAX_LENGTH];
        if (time_manager_is_synchronized()) {
            time_manager_get_timestamp(timestamp_str, sizeof(timestamp_str));
        } else {
            snprintf(timestamp_str, sizeof(timestamp_str), "%lld", (long long)(esp_timer_get_time() / 1000));
        }
        
        // LWT Message: ~80 chars max (fits comfortably in 256)
        snprintf(ctx->lwt_message, sizeof(ctx->lwt_message),
                "{\"esp32_id\":\"%.8s\",\"status\":\"OFFLINE\",\"timestamp\":%.32s}",
                esp32_id, timestamp_str);
        
        xSemaphoreGive(ctx->mutex);
    }
    
    ESP_LOGI(TAG, "Credentials configured");
    return ESP_OK;
}

// Connect to MQTT broker - PRODUCTION READY
esp_err_t mqtt_manager_connect(void) {
    mqtt_manager_context_t *ctx = &s_mqtt_manager_ctx;
    
    if (ctx->event_group == NULL) {
        ESP_LOGE(TAG, "Not initialized");
        return ESP_ERR_INVALID_STATE;
    }
    
    if (strlen(ctx->esp32_id) == 0) {
        ESP_LOGE(TAG, "ESP32 ID not set");
        return ESP_ERR_INVALID_STATE;
    }
    
    if (mqtt_manager_is_connected() || ctx->state == MQTT_MANAGER_STATE_CONNECTING) {
        ESP_LOGW(TAG, "Already connected or connecting");
        return ESP_OK;
    }
    
    if (!wifi_manager_is_connected()) {
        ESP_LOGE(TAG, "WiFi not connected");
        return ESP_ERR_INVALID_STATE;
    }
    
    ESP_LOGI(TAG, "Connecting to MQTT broker");
    
