PQSolutionsPeru/ESP32-IDF/ESP-IDF-HDDESP32/hddesp32/components/mqtt_manager/mqtt_manager.c
    if (xSemaphoreTake(ctx->mutex, portMAX_DELAY) == pdTRUE) {
        ctx->state = MQTT_MANAGER_STATE_CONNECTING;
        xEventGroupClearBits(ctx->event_group, MQTT_CONNECTED_BIT | MQTT_ERROR_BIT);
        
        // Clean existing client
        if (ctx->client != NULL) {
            esp_mqtt_client_destroy(ctx->client);
            ctx->client = NULL;
        }
        
        // Memory cleanup for SSL
        for (int i = 0; i < 3; i++) {
            heap_caps_check_integrity_all(true);
            vTaskDelay(pdMS_TO_TICKS(100));
        }
        
        #ifdef CONFIG_ESP_TASK_WDT_EN
        esp_task_wdt_reset();
        #endif
        
        // Build URI - calculated size: "mqtts://" + broker + ":" + port
        // "mqtts://node02.myqtthub.com:8883" = 31 chars (fits in 128)
        char uri[MQTT_URI_MAX_LENGTH];
        snprintf(uri, sizeof(uri), "%s://%s:%d", ctx->use_ssl ? "mqtts" : "mqtt", ctx->broker_url, ctx->port);
        
        // Configure MQTT client
        esp_mqtt_client_config_t mqtt_cfg = {0};
        mqtt_cfg.broker.address.uri = uri;
        mqtt_cfg.credentials.client_id = ctx->client_id;
        mqtt_cfg.credentials.username = ctx->username;
        mqtt_cfg.credentials.authentication.password = ctx->password;
        mqtt_cfg.session.keepalive = DEFAULT_KEEPALIVE;
        mqtt_cfg.session.disable_clean_session = false;
        
        // Last Will Testament - Update with current timestamp
        if (time_manager_is_synchronized()) {
            char timestamp_str[MQTT_TIMESTAMP_MAX_LENGTH];
            time_manager_get_timestamp(timestamp_str, sizeof(timestamp_str));
            snprintf(ctx->lwt_message, sizeof(ctx->lwt_message),
                    "{\"esp32_id\":\"%s\",\"status\":\"OFFLINE\",\"timestamp\":%s}",
                    ctx->esp32_id, timestamp_str);
        }
        
        mqtt_cfg.session.last_will.topic = ctx->lwt_topic;
        mqtt_cfg.session.last_will.msg = ctx->lwt_message;
        mqtt_cfg.session.last_will.msg_len = strlen(ctx->lwt_message);
        mqtt_cfg.session.last_will.qos = ctx->lwt_qos;
        mqtt_cfg.session.last_will.retain = ctx->lwt_retain;
        
        // Configure SSL
        if (ctx->use_ssl) {
            esp_err_t ssl_ret = mqtt_ssl_setup_minimal_config(&mqtt_cfg);
            if (ssl_ret != ESP_OK) {
                ctx->state = MQTT_MANAGER_STATE_ERROR;
                xEventGroupSetBits(ctx->event_group, MQTT_ERROR_BIT);
                xSemaphoreGive(ctx->mutex);
                ESP_LOGE(TAG, "SSL config failed");
                return ssl_ret;
            }
        }
        
        // Create MQTT client
        ctx->client = esp_mqtt_client_init(&mqtt_cfg);
        if (ctx->client == NULL) {
            ctx->state = MQTT_MANAGER_STATE_ERROR;
            xEventGroupSetBits(ctx->event_group, MQTT_ERROR_BIT);
            xSemaphoreGive(ctx->mutex);
            ESP_LOGE(TAG, "Failed to create MQTT client");
            return ESP_FAIL;
        }
        
        // Register event handler
        esp_mqtt_client_register_event(ctx->client, ESP_EVENT_ANY_ID, mqtt_event_handler, NULL);
        
        // Start client
        esp_err_t ret = esp_mqtt_client_start(ctx->client);
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "Failed to start MQTT client");
            esp_mqtt_client_destroy(ctx->client);
            ctx->client = NULL;
            ctx->state = MQTT_MANAGER_STATE_ERROR;
            xEventGroupSetBits(ctx->event_group, MQTT_ERROR_BIT);
            xSemaphoreGive(ctx->mutex);
            return ret;
        }
        
        xSemaphoreGive(ctx->mutex);
    }
    
    if (ctx->state_callback) {
        ctx->state_callback(ctx->state, ctx->state_user_data);
    }
    
    // Wait for connection
    EventBits_t bits = xEventGroupWaitBits(ctx->event_group,
                                          MQTT_CONNECTED_BIT | MQTT_ERROR_BIT,
                                          pdFALSE, pdFALSE, pdMS_TO_TICKS(15000));
    
    if (bits & MQTT_CONNECTED_BIT) {
        ESP_LOGI(TAG, "MQTT connected successfully");
        return ESP_OK;
    } else if (bits & MQTT_ERROR_BIT) {
        ESP_LOGE(TAG, "MQTT connection error");
        return ESP_FAIL;
    } else {
        ESP_LOGW(TAG, "MQTT connection timeout");
        return ESP_ERR_TIMEOUT;
    }
}

// Disconnect from MQTT
esp_err_t mqtt_manager_disconnect(void) {
    mqtt_manager_context_t *ctx = &s_mqtt_manager_ctx;
    
    if (ctx->event_group == NULL) {
        return ESP_ERR_INVALID_STATE;
    }
    
    if (ctx->client == NULL) {
        return ESP_OK;
    }
    
    ESP_LOGI(TAG, "Disconnecting from MQTT");
    
    if (xSemaphoreTake(ctx->mutex, portMAX_DELAY) == pdTRUE) {
        esp_err_t ret = esp_mqtt_client_stop(ctx->client);
        if (ret != ESP_OK) {
            xSemaphoreGive(ctx->mutex);
            return ret;
        }
        
        ctx->state = MQTT_MANAGER_STATE_DISCONNECTED;
        ctx->was_connected = false;
        xEventGroupClearBits(ctx->event_group, MQTT_CONNECTED_BIT | MQTT_ERROR_BIT);
        xEventGroupSetBits(ctx->event_group, MQTT_DISCONNECTED_BIT);
        
        xSemaphoreGive(ctx->mutex);
    }
    
    if (ctx->state_callback) {
        ctx->state_callback(ctx->state, ctx->state_user_data);
    }
    
    return ESP_OK;
}

// Check if connected
bool mqtt_manager_is_connected(void) {
    mqtt_manager_context_t *ctx = &s_mqtt_manager_ctx;
    
    if (ctx->event_group == NULL) {
        return false;
    }
    
    EventBits_t bits = xEventGroupGetBits(ctx->event_group);
    return (bits & MQTT_CONNECTED_BIT) != 0;
}

// Subscribe to topic
esp_err_t mqtt_manager_subscribe(const char *topic, int qos) {
    mqtt_manager_context_t *ctx = &s_mqtt_manager_ctx;
    
    if (ctx->event_group == NULL || ctx->client == NULL || topic == NULL) {
        return ESP_ERR_INVALID_STATE;
    }
    
    if (qos < 0 || qos > 2) {
        qos = 1;
    }
    
    int msg_id = esp_mqtt_client_subscribe(ctx->client, topic, qos);
    return (msg_id < 0) ? ESP_FAIL : ESP_OK;
}

// Unsubscribe from topic
esp_err_t mqtt_manager_unsubscribe(const char *topic) {
    mqtt_manager_context_t *ctx = &s_mqtt_manager_ctx;
    
    if (ctx->event_group == NULL || ctx->client == NULL || topic == NULL) {
        return ESP_ERR_INVALID_STATE;
    }
    
    int msg_id = esp_mqtt_client_unsubscribe(ctx->client, topic);
    return (msg_id < 0) ? ESP_FAIL : ESP_OK;
}

