PQSolutionsPeru/ESP32-IDF/ESP-IDF-HDDESP32/hddesp32/components/mqtt_manager/mqtt_manager.c
// Publish message
esp_err_t mqtt_manager_publish(const char *topic, const char *data, int data_len, int qos, bool retain) {
    mqtt_manager_context_t *ctx = &s_mqtt_manager_ctx;
    
    if (ctx->event_group == NULL || topic == NULL || data == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    
    if (data_len < 0) {
        data_len = strlen(data);
    }
    
    if (qos < 0 || qos > 2) {
        qos = 1;
    }
    
    if (data_len > DEFAULT_BUFFER_SIZE) {
        ESP_LOGE(TAG, "Message too large: %d bytes", data_len);
        return ESP_ERR_INVALID_SIZE;
    }
    
    // Queue message if not connected
    if (!mqtt_manager_is_connected()) {
        mqtt_pending_message_t pending_msg;
        strncpy(pending_msg.topic, topic, sizeof(pending_msg.topic) - 1);
        pending_msg.topic[sizeof(pending_msg.topic) - 1] = '\0';
        
        if (data_len > sizeof(pending_msg.data) - 1) {
            data_len = sizeof(pending_msg.data) - 1;
        }
        memcpy(pending_msg.data, data, data_len);
        pending_msg.data[data_len] = '\0';
        
        pending_msg.data_len = data_len;
        pending_msg.qos = qos;
        pending_msg.retain = retain;
        
        if (xQueueSend(ctx->pending_messages, &pending_msg, 0) != pdTRUE) {
            ESP_LOGE(TAG, "Message queue full");
            return ESP_ERR_NO_MEM;
        }
        return ESP_OK;
    }
    
    int msg_id = esp_mqtt_client_publish(ctx->client, topic, data, data_len, qos, retain);
    if (msg_id < 0) {
        ESP_LOGE(TAG, "Failed to publish to: %s", topic);
        return ESP_FAIL;
    }
    
    ctx->last_activity_time = esp_timer_get_time() / 1000;
    return ESP_OK;
}

// Publish JSON message
esp_err_t mqtt_manager_publish_json(const char *topic, const char *json_data, int qos, bool retain) {
    if (topic == NULL || json_data == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    
    return mqtt_manager_publish(topic, json_data, strlen(json_data), qos, retain);
}

// Process MQTT loop
esp_err_t mqtt_manager_loop(int timeout_ms) {
    mqtt_manager_context_t *ctx = &s_mqtt_manager_ctx;
    
    if (ctx->event_group == NULL) {
        return ESP_ERR_INVALID_STATE;
    }
    
    // Send heartbeat if needed
    int64_t current_time = esp_timer_get_time() / 1000;
    if (mqtt_manager_is_connected() && 
        (current_time - ctx->last_heartbeat_time > DEFAULT_STATUS_INTERVAL_MS)) {
        mqtt_manager_send_heartbeat();
    }
    
    // Handle reconnection
    if (ctx->state == MQTT_MANAGER_STATE_RECONNECTING && 
        (current_time - ctx->last_reconnect_time > DEFAULT_RECONNECT_TIMEOUT_MS)) {
        
        ctx->last_reconnect_time = current_time;
        
        if (wifi_manager_is_connected()) {
            ctx->reconnect_attempts++;
            
            if (ctx->reconnect_attempts <= DEFAULT_MAX_RETRIES) {
                ESP_LOGI(TAG, "MQTT reconnect attempt %d/%d", ctx->reconnect_attempts, DEFAULT_MAX_RETRIES);
                mqtt_manager_connect();
            } else {
                ESP_LOGE(TAG, "Max MQTT reconnect attempts reached");
                ctx->state = MQTT_MANAGER_STATE_ERROR;
                
                if (ctx->state_callback) {
                    ctx->state_callback(ctx->state, ctx->state_user_data);
                }
                
                if (current_time - ctx->last_reconnect_time > DEFAULT_RECONNECT_TIMEOUT_MS * 2) {
                    ctx->reconnect_attempts = 0;
                }
            }
        }
    }
    
    // Auto-connect if WiFi connected but MQTT not
    if (wifi_manager_is_connected() && 
        !mqtt_manager_is_connected() && 
        ctx->state != MQTT_MANAGER_STATE_CONNECTING && 
        ctx->state != MQTT_MANAGER_STATE_RECONNECTING) {
        
        if (current_time - ctx->last_reconnect_time > DEFAULT_RECONNECT_TIMEOUT_MS) {
            ctx->last_reconnect_time = current_time;
            mqtt_manager_connect();
        }
    }
    
    return ESP_OK;
}

// Set message callback
esp_err_t mqtt_manager_set_message_callback(mqtt_manager_message_callback_t callback, void *user_data) {
    mqtt_manager_context_t *ctx = &s_mqtt_manager_ctx;
    
    if (ctx->event_group == NULL) {
        return ESP_ERR_INVALID_STATE;
    }
    
    if (xSemaphoreTake(ctx->mutex, portMAX_DELAY) == pdTRUE) {
        ctx->message_callback = callback;
        ctx->message_user_data = user_data;
        xSemaphoreGive(ctx->mutex);
    }
    
    return ESP_OK;
}

// Set state callback
esp_err_t mqtt_manager_set_state_callback(mqtt_manager_state_callback_t callback, void *user_data) {
    mqtt_manager_context_t *ctx = &s_mqtt_manager_ctx;
    
    if (ctx->event_group == NULL) {
        return ESP_ERR_INVALID_STATE;
    }
    
    if (xSemaphoreTake(ctx->mutex, portMAX_DELAY) == pdTRUE) {
        ctx->state_callback = callback;
        ctx->state_user_data = user_data;
        xSemaphoreGive(ctx->mutex);
    }
    
    return ESP_OK;
}

// Get current state
mqtt_manager_state_t mqtt_manager_get_state(void) {
    mqtt_manager_context_t *ctx = &s_mqtt_manager_ctx;
    
    if (ctx->event_group == NULL) {
        return MQTT_MANAGER_STATE_INIT;
    }
    
    return ctx->state;
}

// Send network info - PRODUCTION READY with calculated buffer sizes
esp_err_t mqtt_manager_send_network_info(void) {
    mqtt_manager_context_t *ctx = &s_mqtt_manager_ctx;
    
    if (ctx->event_group == NULL || strlen(ctx->esp32_id) == 0) {
        return ESP_ERR_INVALID_STATE;
    }
    
    char json_buffer[MQTT_JSON_BUFFER_MAX_LENGTH];
    char ip_address[16] = "0.0.0.0";
    
    wifi_manager_get_ip(ip_address, sizeof(ip_address));
    
    char timestamp_str[MQTT_TIMESTAMP_MAX_LENGTH];
    char time_str[64]; 
    
    if (time_manager_is_synchronized()) {
        time_manager_get_timestamp(timestamp_str, sizeof(timestamp_str));
        time_manager_get_lima_time_str(time_str, sizeof(time_str));
    } else {
        time_t now = time(NULL);
        if (now > 1577836800) {  // Valid time
            snprintf(timestamp_str, sizeof(timestamp_str), "%ld", (long)now);
            
            struct tm *timeinfo = gmtime(&now);
            if (timeinfo) {
                time_t peru_time = now - (5 * 3600);
                struct tm *peru_timeinfo = gmtime(&peru_time);
                if (peru_timeinfo) {
                    strftime(time_str, sizeof(time_str), "%d/%m/%Y, %H:%M:%S", peru_timeinfo);
                } else {
                    snprintf(time_str, sizeof(time_str), "Time unavailable");
                }
            } else {
                snprintf(time_str, sizeof(time_str), "Time unavailable");
            }
        } else {
            snprintf(timestamp_str, sizeof(timestamp_str), "%lld", (long long)(esp_timer_get_time() / 1000));
            snprintf(time_str, sizeof(time_str), "System: %lld ms", (long long)(esp_timer_get_time() / 1000));
        }
    }
    
    // Calculated JSON size: ~150 chars max - fits comfortably in 512 bytes
    int len = snprintf(json_buffer, sizeof(json_buffer),
                      "{\"esp32_id\":\"%s\",\"MAC\":\"%s\",\"IP\":\"%s\","
                      "\"status\":\"ONLINE\",\"timestamp\":%s,\"time\":\"%s\"}",
                      ctx->esp32_id, ctx->mac_address, ip_address, timestamp_str, time_str);
    
    if (len < 0 || len >= sizeof(json_buffer)) {
        return ESP_ERR_NO_MEM;
    }
    
    return mqtt_manager_publish("esp32/network_info", json_buffer, strlen(json_buffer), 0, false);
}

// Send heartbeat - PRODUCTION READY with calculated buffer sizes
esp_err_t mqtt_manager_send_heartbeat(void) {
    mqtt_manager_context_t *ctx = &s_mqtt_manager_ctx;
    
    if (ctx->event_group == NULL || strlen(ctx->esp32_id) == 0) {
        return ESP_ERR_INVALID_STATE;
    }
    
    if (!mqtt_manager_is_connected()) {
        return ESP_FAIL;
    }
    
