PQSolutionsPeru/ESP32-IDF/ESP-IDF-HDDESP32/hddesp32/components/mqtt_manager/mqtt_manager.c
    char json_buffer[MQTT_JSON_BUFFER_MAX_LENGTH];
    char message_id[32];
    
    generate_message_id(message_id, sizeof(message_id));
    
    char topic[MQTT_TOPIC_MAX_LENGTH];
    snprintf(topic, sizeof(topic), "system/status/%s", ctx->esp32_id);
    
    char timestamp_str[MQTT_TIMESTAMP_MAX_LENGTH];
    char time_str[64] = {0};
    
    if (time_manager_is_synchronized()) {
        time_manager_get_timestamp(timestamp_str, sizeof(timestamp_str));
        time_manager_get_lima_time_str(time_str, sizeof(time_str));
    } else {
        snprintf(timestamp_str, sizeof(timestamp_str), "%lld", (long long)(esp_timer_get_time() / 1000));
    }
    
    int len;
    if (strlen(ctx->client_panel_id) > 0 && strlen(ctx->panel_id) > 0) {
        if (time_str[0] != 0) {
            // Calculated JSON size: ~200 chars max - fits comfortably in 512 bytes  
            len = snprintf(json_buffer, sizeof(json_buffer),
                          "{\"esp32_id\":\"%s\",\"status\":\"ONLINE\","
                          "\"timestamp\":%s,\"type\":\"heartbeat\","
                          "\"message_id\":\"%s\",\"client_id\":\"%s\","
                          "\"panel_id\":\"%s\",\"time\":\"%s\"}",
                          ctx->esp32_id, timestamp_str, message_id,
                          ctx->client_panel_id, ctx->panel_id, time_str);
        } else {
            len = snprintf(json_buffer, sizeof(json_buffer),
                          "{\"esp32_id\":\"%s\",\"status\":\"ONLINE\","
                          "\"timestamp\":%s,\"type\":\"heartbeat\","
                          "\"message_id\":\"%s\",\"client_id\":\"%s\","
                          "\"panel_id\":\"%s\"}",
                          ctx->esp32_id, timestamp_str, message_id,
                          ctx->client_panel_id, ctx->panel_id);
        }
    } else {
        if (time_str[0] != 0) {
            len = snprintf(json_buffer, sizeof(json_buffer),
                          "{\"esp32_id\":\"%s\",\"status\":\"ONLINE\","
                          "\"timestamp\":%s,\"type\":\"heartbeat\","
                          "\"message_id\":\"%s\",\"time\":\"%s\"}",
                          ctx->esp32_id, timestamp_str, message_id, time_str);
        } else {
            len = snprintf(json_buffer, sizeof(json_buffer),
                          "{\"esp32_id\":\"%s\",\"status\":\"ONLINE\","
                          "\"timestamp\":%s,\"type\":\"heartbeat\","
                          "\"message_id\":\"%s\"}",
                          ctx->esp32_id, timestamp_str, message_id);
        }
    }
    
    if (len < 0 || len >= sizeof(json_buffer)) {
        return ESP_ERR_NO_MEM;
    }
    
    esp_err_t ret = mqtt_manager_publish(topic, json_buffer, len, 1, false);
    
    if (ret == ESP_OK) {
        ctx->last_heartbeat_time = esp_timer_get_time() / 1000;
    }
    
    return ret;
}